<!-- dflook/terraform-github-actions {"workspace":"judo-techniques-bot","backend_type":"remote","plan_modifier":"b3d6c56855568c54dc21424da9739e859d3073ade4fffbedbfb4f72ad6c5e64f","backend":"fa030b21e78210177eec044fa2be3c59cf675dcb310102660ca9d155721090b2","plan_job_ref":"Job Terraform Plan #31 at https://github.com/AbundantSalmon/judo-techniques-bot/actions/runs/7201970313","plan_hash":"a39e00e8347c56324a4fd0e592dce305d527ec7f2a7a7a0cd5c4e6074b26be3a","plan_text_format":"text","version":"1.38.0"} -->
Terraform plan in __./terraform__ in the __judo-techniques-bot__ workspace
Replacing resources: `aws_launch_template.launch_template`, `aws_ecs_task_definition.jtb_task_definition`
<details>
<summary>Plan: 2 to add, 2 to change, 2 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_autoscaling_group.autoscaling_group will be updated in-place
  ~ resource "aws_autoscaling_group" "autoscaling_group" {
        id                               = "terraform-20231117155058700100000005"
        name                             = "terraform-20231117155058700100000005"
        # (27 unchanged attributes hidden)

      ~ launch_template {
          ~ id      = "********************" -> (known after apply)
            name    = "EcsClusterjtb_ecs-clusterLaunchTemplate"
          ~ version = "1" -> (known after apply)
        }

        # (5 unchanged blocks hidden)
    }

  # aws_ecs_service.jtb_service will be updated in-place
  ~ resource "aws_ecs_service" "jtb_service" {
        id                                 = "arn:aws:ecs:us-east-2:596332158252:service/jtb_ecs-cluster/EcsClusterjtb_ecs-clusterService"
        name                               = "EcsClusterjtb_ecs-clusterService"
        tags                               = {
            "Module" = "ECS Cluster"
            "Name"   = "jtb_ecs-cluster"
        }
      ~ task_definition                    = "arn:aws:ecs:us-east-2:596332158252:task-definition/EcsClusterjtb_ecs-clusterTaskDefinition:11" -> (known after apply)
        # (13 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.jtb_task_definition must be replaced
-/+ resource "aws_ecs_task_definition" "jtb_task_definition" {
      ~ arn                      = "arn:aws:ecs:us-east-2:596332158252:task-definition/EcsClusterjtb_ecs-clusterTaskDefinition:11" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-2:596332158252:task-definition/EcsClusterjtb_ecs-clusterTaskDefinition" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  - cpu          = 0
                  - environment  = []
                  - essential    = true
                  - mountPoints  = []
                    name         = "jtb"
                  - portMappings = []
                  - volumesFrom  = []
                    # (2 unchanged attributes hidden)
                },
            ]
        )
      ~ id                       = "***************************************" -> (known after apply)
      ~ revision                 = 11 -> (known after apply)
        tags                     = {
            "Module" = "ECS Cluster"
            "Name"   = "jtb_ecs-cluster"
        }
        # (7 unchanged attributes hidden)
    }

  # aws_launch_template.launch_template must be replaced
-/+ resource "aws_launch_template" "launch_template" {
      ~ arn                     = "arn:aws:ec2:us-east-2:596332158252:launch-template/lt-0212b2caac16f8d24" -> (known after apply)
      ~ default_version         = 1 -> (known after apply)
      - disable_api_stop        = false -> null
      - disable_api_termination = false -> null
      ~ id                      = "********************" -> (known after apply)
      ~ latest_version          = 1 -> (known after apply)
        name                    = "EcsClusterjtb_ecs-clusterLaunchTemplate"
      + name_prefix             = (known after apply)
      - security_group_names    = [] -> null
      - tags                    = {} -> null
      ~ tags_all                = {} -> (known after apply)
        # (5 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 2 to add, 2 to change, 2 to destroy.
```
</details>

:memo: Plan generated in [Terraform Plan #31](https://github.com/AbundantSalmon/judo-techniques-bot/actions/runs/7201970313)